"""
競技プログラミング研究会2024第二回復習問題
既にに書かれているコード及び問題文は消さないこと。
"""

N_int = 3
S_str = "12"
a, b, c, d = 57, 998244353, 10**9 + 7, 20021007
big_num = 10**18 - 1
num = 123
"""
基本問題
"""
# Q1 変数Nをstr型に変換したものをN_strに代入せよ。


# Q2 変数S_strをint型に変換したものをS_intに代入せよ。


# Q3 変数N_strのデータ型を出力せよ。


# Q4 変数S_intのデータ型を出力せよ。


# Q5 変数a,b,c,dの総和を 141007 で割った余りを出力せよ。


# Q6 変数aの5乗した値を 428 で割った答えを、小数点以下を切り捨てた整数で出力せよ。


# Q7 変数aの値を元の値の二倍に更新したうえで、aの値を出力せよ。


# Q8 変数cの値を元の値より1大きい数に更新したうえで、cの値を出力せよ。


"""
応用問題

応用問題です。興味ある方は解いてみてください。
"""
# Q1 変数big_numを5で割り、小数点以下を切り上げた整数で出力せよ。(切り上げであることに注意)


# Q2 変数numを1000倍した値を出力せよ。ただし、演算子 "*" は使用できないものとする。


# Q3 変数x, y は 0 <= x <= 9, 0<= y <= 9を満たす整数型のデータである。
#    x + y と int(str(x) + str(y)) が等しいとき、x, yの値として考えられる組を全て出力せよ。
#    下記の例の1,7の部分を書き直す形で出力せよ。(1,7)の組は例であり、正しいとは限らない。
print("x: ", 1, "y: ", 7)


# Q3 変数x, y は 0 <= x <= 9, 0<= y <= 9を満たす整数型のデータである。
#    x * y と int(str(x) * y) が等しいとき、x, yの値として考えられる組を全て出力せよ。
#    下記の例の1,7の部分を書き直す形で出力せよ。(1,7)の組は例であり、正しいとは限らない。
print("x: ", 1, "y: ", 7)
